app/Controllers/Home.php

    public function login()
{
    $usermodel = new Users();
    $session = session();

    $id = $this->request->getPost('username');
    $pass = $usermodel->where('username', $id)->first(); // Fetch the first matching user
---
SELECT *
FROM `users`
WHERE `username` = 'lii'
 LIMIT 1